Documents/БухгалтерскаяСправкаПоЗатратам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>БухгалтерскаяСправкаПоЗатратам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтатьиЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БухгалтерскаяСправкаПоЗатратам/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
		|	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
		|	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|	И РасчетыПоЛицевымСчетам.МесяцНачисления = &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Организация = &Организация
		|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление))
		|	И НЕ РасчетыПоЛицевымСчетам.Услуга.НеВключатьВРаспределение
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
		|	РасчетыПоЛицевымСчетам.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка.Дата КАК Период,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Затрата КАК СтатьяЗатрат,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Сумма
		|ИЗ
		|	Документ.БухгалтерскаяСправкаПоЗатратам.СтатьиЗатрат КАК БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат
		|ГДЕ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка = &Ссылка
		|	И БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание <> ЗНАЧЕНИЕ(Справочник.ЗданияИСооружения.ПустаяСсылка)
		|	И БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка.Дата КАК Период,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Затрата КАК СтатьяЗатрат,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Сумма
		|ИЗ
		|	Документ.БухгалтерскаяСправкаПоЗатратам.СтатьиЗатрат КАК БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат
		|ГДЕ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка = &Ссылка
		|	И (БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание = ЗНАЧЕНИЕ(Справочник.ЗданияИСооружения.ПустаяСсылка)
		|			ИЛИ БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаНачислений = РезультатЗапроса[0].Выгрузить();
	ТаблицаПрямыхЗатрат = РезультатЗапроса[1].Выгрузить();
	ТаблицаЗатратДляРаспределения = РезультатЗапроса[2].Выгрузить();
	
	Для каждого СтрокаЗатрат Из ТаблицаЗатратДляРаспределения Цикл
		Если ЗначениеЗаполнено(СтрокаЗатрат.Здание) И НЕ ЗначениеЗаполнено(СтрокаЗатрат.Услуга) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Здание", СтрокаЗатрат.Здание); 
			ТаблицаТМП = ТаблицаНачислений.Скопировать(Отбор);
		
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаЗатрат.Здание) И ЗначениеЗаполнено(СтрокаЗатрат.Услуга) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", СтрокаЗатрат.Услуга); 
			ТаблицаТМП = ТаблицаНачислений.Скопировать(Отбор);
			
		Иначе
			ТаблицаТМП = ТаблицаНачислений.Скопировать();
			
		КонецЕсли; 
		
		ИтогБаза = ТаблицаТМП.Итог("Сумма");
		ОстатокРаспределения = СтрокаЗатрат.Сумма;
		
		Если ИтогБаза = 0 Тогда
			НоваяСтрока = ТаблицаПрямыхЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатрат); 
		Иначе	
			Для каждого СтрокаТМП Из ТаблицаТМП Цикл
				
				Сумма = Окр(СтрокаЗатрат.Сумма * (СтрокаТМП.Сумма / ИтогБаза ), 2);
				Если Сумма = 0 Тогда
					Продолжить;
				КонецЕсли; 
				
				НоваяСтрока = ТаблицаПрямыхЗатрат.Добавить();
				НоваяСтрока.Период = СтрокаЗатрат.Период;
				НоваяСтрока.СтатьяЗатрат = СтрокаЗатрат.СтатьяЗатрат;
				НоваяСтрока.Здание = СтрокаТМП.Здание;
				НоваяСтрока.Услуга = СтрокаТМП.Услуга;
				НоваяСтрока.Сумма = Сумма;
				
				ОстатокРаспределения = ОстатокРаспределения - НоваяСтрока.Сумма;
				
			КонецЦикла; 
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + ОстатокРаспределения;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатьиЗатрат", ТаблицаПрямыхЗатрат);

КонецПроцедуры

// Выполняет контроль закрытия месяца.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка КАК Здание,
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|		ПО ЗданияИСооружения.Ссылка = ДатыЗапретаИзменения.Объект
		|ГДЕ
		|	ЗданияИСооружения.Организация = &Организация
		|	И ДатыЗапретаИзменения.ДатаЗапрета < &ДатаЗапрета";
		
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Организация);
	Запрос.УстановитьПараметр("ДатаЗапрета", НачалоМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ДокументОбъектБухгалтерскаяСправкаПоЗатратам = ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.ПолучитьОбъект();
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструСтатьиЗатратСписком(ДокументОбъектБухгалтерскаяСправкаПоЗатратам, ВыборкаИзРезультатаЗапроса, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
